docs/html/docs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-10 Sat 15:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rotate Programming Language Documentation</title>
<meta name="author" content="Airbus5717" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="extra.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Rotate Programming Language Documentation</h1>

<div id="outline-container-org444f7f8" class="outline-2">
<h2 id="org444f7f8">About</h2>
<div class="outline-text-2" id="text-org444f7f8">
<ul class="org-ul">
<li>Low learning curve.</li>
<li>[.vr] file extension.</li>
<li>syntax close to C-like languages and Rust</li>
<li>static typing and scripting language</li>
</ul>

<p>
<code>WARNING: SYNTAX MAY CHANGE AT ANY MOMENT</code>
</p>
</div>
</div>

<div id="outline-container-org48ae332" class="outline-2">
<h2 id="org48ae332">Overview</h2>
<div class="outline-text-2" id="text-org48ae332">
</div>
<div id="outline-container-org2ee4e2c" class="outline-3">
<h3 id="org2ee4e2c">Display output</h3>
<div class="outline-text-3" id="text-org2ee4e2c">
<div class="org-src-container">
<pre class="src src-rust" id="org281dadc">import std.io;

<span style="color: #FC5FA3; font-weight: bold;">fn</span> <span style="color: #41A1C0;">main</span>() {
    println(<span style="color: #FC6A5D;">"Hello World!"</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c06f49" class="outline-3">
<h3 id="org9c06f49">Comments</h3>
<div class="outline-text-3" id="text-org9c06f49">
<div class="org-src-container">
<pre class="src src-D" id="org02adfb8">// single line comment
/* multiline
   comment */
/+ multiline 
   comment 
   +/
/// documentation comment
</pre>
</div>
<div class="org-src-container">
<pre class="src src-D" id="org367d2c5">/*
    // nested multiline comments are not allowed
*/
/+ 
    /* 
        Allowed
    */
+/
</pre>
</div>
</div>
</div>
<div id="outline-container-org3ecb3b7" class="outline-3">
<h3 id="org3ecb3b7">Variables</h3>
<div class="outline-text-3" id="text-org3ecb3b7">
<div class="org-src-container">
<pre class="src src-rust" id="orgb1bd28a"><span style="color: #6C7986;">// </span><span style="color: #6C7986;">immutable string</span>
<span style="color: #FC5FA3; font-weight: bold;">let</span> <span style="color: #41A1C0;">NAME</span>: <span style="color: #5DD8FF;">str</span> = <span style="color: #FC6A5D;">"a string"</span>;
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">mutable string</span>
<span style="color: #FC5FA3; font-weight: bold;">let</span> <span style="color: #FC5FA3; font-weight: bold;">mut</span> <span style="color: #41A1C0;">name</span>: <span style="color: #5DD8FF;">str</span> = <span style="color: #FC6A5D;">"mutable string"</span>;

<span style="color: #6C7986;">// </span><span style="color: #6C7986;">immutable ascii char</span>
<span style="color: #FC5FA3; font-weight: bold;">let</span> <span style="color: #41A1C0;">char1</span>: <span style="color: #5DD8FF;">char</span> = <span style="color: #FC6A5D;">'a'</span>;
<span style="color: #6C7986;">// </span><span style="color: #6C7986;">immutable int</span>
<span style="color: #FC5FA3; font-weight: bold;">let</span> <span style="color: #41A1C0;">x</span>: int = <span style="color: #D0BF68; font-weight: bold;">1</span>;

<span style="color: #FC5FA3; font-weight: bold;">let</span> <span style="color: #41A1C0;">num</span>: float = <span style="color: #D0BF68; font-weight: bold;">12.0</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb914e54" class="outline-3">
<h3 id="orgb914e54">Arrays</h3>
<div class="outline-text-3" id="text-orgb914e54">
<div class="org-src-container">
<pre class="src src-rust" id="org705fb10"><span style="color: #FC5FA3; font-weight: bold;">let</span> <span style="color: #41A1C0;">array</span>[<span style="color: #D0BF68; font-weight: bold;">3</span>]: int = [<span style="color: #D0BF68; font-weight: bold;">1</span>, <span style="color: #D0BF68; font-weight: bold;">2</span>, <span style="color: #D0BF68; font-weight: bold;">3</span>];
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c1ef4b" class="outline-3">
<h3 id="org6c1ef4b">Functions</h3>
<div class="outline-text-3" id="text-org6c1ef4b">
<p>
use arrow for return type.
don&rsquo;t use arrow for void functions.
</p>
<div class="org-src-container">
<pre class="src src-rust" id="org88e72a4"><span style="color: #FC5FA3; font-weight: bold;">fn</span> <span style="color: #41A1C0;">example</span>() -&gt; <span style="color: #5DD8FF;">str</span> {
    <span style="color: #FC5FA3; font-weight: bold;">return</span> <span style="color: #FC6A5D;">"example string"</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga6c4eb5" class="outline-3">
<h3 id="orga6c4eb5">Imports</h3>
<div class="outline-text-3" id="text-orga6c4eb5">
<p>
import folder.file;
</p>
<div class="org-src-container">
<pre class="src src-C" id="org777976c"><span style="color: #5DD8FF;">import</span> <span style="color: #41A1C0;">std</span>.io;
</pre>
</div>
</div>
</div>

<div id="outline-container-org299eac2" class="outline-3">
<h3 id="org299eac2">Strings</h3>
<div class="outline-text-3" id="text-org299eac2">
<div class="org-src-container">
<pre class="src src-rust" id="org21928af"><span style="color: #FC5FA3; font-weight: bold;">let</span> <span style="color: #41A1C0;">name</span> = <span style="color: #FC6A5D;">"Hello"</span>;
<span style="color: #FC5FA3; font-weight: bold;">let</span> <span style="color: #41A1C0;">name2</span> = #<span style="color: #FC6A5D;">"{name}, World!"</span>#;
</pre>
</div>
</div>
</div>

<div id="outline-container-org77b6eeb" class="outline-3">
<h3 id="org77b6eeb">Operators and Logic</h3>
<div class="outline-text-3" id="text-org77b6eeb">
<p>
same as C and Rust with little modifications
</p>
</div>
</div>

<div id="outline-container-orgdafc484" class="outline-3">
<h3 id="orgdafc484">If statements</h3>
<div class="outline-text-3" id="text-orgdafc484">
<div class="org-src-container">
<pre class="src src-rust" id="org0ff5ba3"><span style="color: #FC5FA3; font-weight: bold;">if</span> x == <span style="color: #D0BF68; font-weight: bold;">1</span> {
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">code</span>
} <span style="color: #FC5FA3; font-weight: bold;">else</span> <span style="color: #FC5FA3; font-weight: bold;">if</span> x == <span style="color: #D0BF68; font-weight: bold;">2</span> {
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">code</span>
} <span style="color: #FC5FA3; font-weight: bold;">else</span> {
    <span style="color: #6C7986;">// </span><span style="color: #6C7986;">code</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org66366da" class="outline-3">
<h3 id="org66366da">Match statements</h3>
<div class="outline-text-3" id="text-org66366da">
<div class="org-src-container">
<pre class="src src-rust" id="orgaa7c43c"><span style="color: #FC5FA3; font-weight: bold;">match</span> x {
    | <span style="color: #D0BF68; font-weight: bold;">1</span> : <span style="color: #6C7986;">// </span><span style="color: #6C7986;">do ;</span>
    | <span style="color: #D0BF68; font-weight: bold;">2</span> : <span style="color: #6C7986;">// </span><span style="color: #6C7986;">do ;</span>
    | <span style="color: #D0BF68; font-weight: bold;">3</span> : <span style="color: #6C7986;">// </span><span style="color: #6C7986;">do ;</span>
    | _ : <span style="color: #6C7986;">// </span><span style="color: #6C7986;">default;</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a396d4" class="outline-3">
<h3 id="org3a396d4">Loops</h3>
<div class="outline-text-3" id="text-org3a396d4">
<p>
for and while loops as well as a foreach loop
</p>
<div class="org-src-container">
<pre class="src src-rust" id="org64f2b90">foreach (i, <span style="color: #D0BF68; font-weight: bold;">0</span>..<span style="color: #D0BF68; font-weight: bold;">2</span>) {
    println(#<span style="color: #FC6A5D;">"{i}"</span>#);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0d7ffd8" class="outline-2">
<h2 id="org0d7ffd8">Considering Later</h2>
<div class="outline-text-2" id="text-org0d7ffd8">
</div>
<div id="outline-container-org6abc871" class="outline-3">
<h3 id="org6abc871">Structures</h3>
<div class="outline-text-3" id="text-org6abc871">
<p>
similar to C but without typedef and with functions
</p>

<hr />
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Airbus5717</p>
<p class="date">Created: 2021-07-10 Sat 15:15</p>
</div>
</body>
</html>
